



MPLS Working Group                                         E. Bellagamba
Internet-Draft
Intended status: Standards Track                               G. Mirsky
Expires: February 1, 2016                                       Ericsson
                                                            L. Andersson
                                                     Huawei Technologies
                                                           P. Skoldstrom
                                                                Acreo AB
                                                                 D. Ward
                                                                   Cisco
                                                                J. Drake
                                                                 Juniper
                                                           July 31, 2015


 Configuration of Proactive Operations, Administration, and Maintenance
    (OAM) Functions for MPLS-based Transport Networks using LSP Ping
              draft-ietf-mpls-lsp-ping-mpls-tp-oam-conf-10

Abstract

   This specification describes the configuration of proactive MPLS-TP
   Operations, Administration, and Maintenance (OAM) Functions for a
   given LSP using a set of TLVs that are carried by the LSP-Ping
   protocol.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on February 1, 2016.

Copyright Notice

   Copyright (c) 2015 IETF Trust and the persons identified as the
   document authors.  All rights reserved.




Bellagamba, et al.      Expires February 1, 2016                [Page 1]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
     1.1.  Conventions used in this document . . . . . . . . . . . .   4
       1.1.1.  Terminology . . . . . . . . . . . . . . . . . . . . .   4
       1.1.2.  Requirements Language . . . . . . . . . . . . . . . .   4
   2.  Theory of Operations  . . . . . . . . . . . . . . . . . . . .   4
     2.1.  MPLS OAM Configuration Operation Overview . . . . . . . .   4
       2.1.1.  Configuration of BFD Sessions . . . . . . . . . . . .   5
       2.1.2.  Configuration of Performance Monitoring . . . . . . .   6
       2.1.3.  Configuration of Fault Management Signals . . . . . .   6
     2.2.  MPLS OAM Functions TLV  . . . . . . . . . . . . . . . . .   6
       2.2.1.  BFD Configuration Sub-TLV . . . . . . . . . . . . . .   8
       2.2.2.  Local Discriminator Sub-TLV . . . . . . . . . . . . .  10
       2.2.3.  Negotiation Timer Parameters Sub-TLV  . . . . . . . .  10
       2.2.4.  BFD Authentication Sub-TLV  . . . . . . . . . . . . .  12
       2.2.5.  Traffic Class Sub-TLV . . . . . . . . . . . . . . . .  13
       2.2.6.  Performance Measurement Sub-TLV . . . . . . . . . . .  13
       2.2.7.  PM Loss Measurement Sub-TLV . . . . . . . . . . . . .  15
       2.2.8.  PM Delay Measurement Sub-TLV  . . . . . . . . . . . .  16
       2.2.9.  Fault Management Signal Sub-TLV . . . . . . . . . . .  17
       2.2.10. Source MEP-ID Sub-TLV . . . . . . . . . . . . . . . .  18
   3.  Summary of MPLS OAM Configuration Errors  . . . . . . . . . .  19
   4.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  20
     4.1.  TLV and Sub-TLV Allocation  . . . . . . . . . . . . . . .  20
     4.2.  OAM Configuration Errors  . . . . . . . . . . . . . . . .  21
   5.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  22
   6.  Security Considerations . . . . . . . . . . . . . . . . . . .  22
   7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  23
     7.1.  Normative References  . . . . . . . . . . . . . . . . . .  23
     7.2.  Informative References  . . . . . . . . . . . . . . . . .  24
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  25

1.  Introduction

   This document describes the configuration of proactive MPLS-TP
   Operations, Administration, and Maintenance (OAM) Functions for a
   given LSP using TLVs carried in LSP-Ping [RFC4379].  In particular it



Bellagamba, et al.      Expires February 1, 2016                [Page 2]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   specifies the mechanisms necessary to establish MPLS-TP OAM entities
   at the maintenance points for monitoring and performing measurements
   on an LSP, as well as defining information elements and procedures to
   configure proactive MPLS-TP OAM functions running between LERs.
   Initialization and control of on-demand MPLS-TP OAM functions are
   expected to be carried out by directly accessing network nodes via a
   management interface; hence configuration and control of on-demand
   OAM functions are out-of-scope for this document.

   The Transport Profile of MPLS must, by definition [RFC5654], be
   capable of operating without a control plane.  Therefore there are
   several options for configuring MPLS-TP OAM, without a control plane
   by either using an NMS or LSP Ping, or with a control plane using
   signaling protocols RSVP-TE [RFC3209] and/or T-LDP [RFC5036].

   MPLS Transport Profile (MPLS-TP) describes a profile of MPLS that
   enables operational models typical in transport networks, while
   providing additional OAM, survivability and other maintenance
   functions not currently supported by MPLS.  [RFC5860] defines the
   requirements for the OAM functionality of MPLS-TP.

   Proactive MPLS-TP OAM is performed by set of protocols, Bi-
   directional Forwarding Detection (BFD) [RFC6428] for Continuity
   Check/Connectivity Verification, the delay measurement protocol (DM)
   [RFC6374], [RFC6375] for delay and delay variation (jitter)
   measurements, and the loss measurement (LM) protocol [RFC6374],
   [RFC6375] for packet loss and throughput measurements.  Additionally,
   there is a number of Fault Management Signals that can be configured
   [RFC6427].

   BFD is a protocol that provides low-overhead, fast detection of
   failures in the path between two forwarding engines, including the
   interfaces, data link(s), and, to the extent possible, the forwarding
   engines themselves.  BFD can be used to detect the continuity and
   mis-connection defects of MPLS-TP point-to-point and might also be
   extended to support point-to-multipoint label switched paths (LSPs).

   The delay and loss measurements protocols [RFC6374], [RFC6375] use a
   simple query/response model for performing both uni- and bi-
   directional measurements that allow the originating node to measure
   packet loss and delay in forward or forward and reverse directions.
   By timestamping and/or writing current packet counters to the
   measurement packets at four times (Tx and Rx in both directions)
   current delays and packet losses can be calculated.  By performing
   successive delay measurements the delay and/or inter-packet delay
   variation (jitter) can be calculated.  Current throughput can be
   calculated from the packet loss measurements by dividing the number
   of packets sent/received with the time it took to perform the



Bellagamba, et al.      Expires February 1, 2016                [Page 3]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   measurement, given by the timestamp in LM header.  Combined with a
   packet generator the throughput measurement can be used to measure
   the maximum capacity of a particular LSP.  It should be noted that
   here we are not configuring on-demand throughput estimates based on
   saturating the connection as defined in [RFC6371].  Rather, we only
   enable the estimation of the current throughput based on loss
   measurements.

1.1.  Conventions used in this document

1.1.1.  Terminology

   BFD - Bidirectional Forwarding Detection

   DM - Delay Measurement

   FMS - Fault Management Signal

   G-ACh - Generic Associated Channel

   LSP - Label Switched Path

   LM - Loss Measurement

   MEP - Maintenance Entity Group End Point

   MPLS - Multi-Protocol Label Switching

   MPLS-TP - MPLS Transport Profile

   PM - Performance Measurement

   TC - Traffic Class

1.1.2.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

2.  Theory of Operations

2.1.  MPLS OAM Configuration Operation Overview

   The MPLS-TP OAM tool set is described in the [RFC6669].

   LSP Ping, or alternatively RSVP-TE [RSVP-TE-CONF], can be used to
   simply enable the different OAM functions, by setting the



Bellagamba, et al.      Expires February 1, 2016                [Page 4]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   corresponding flags in the MPLS OAM Functions TLV, Section 2.2.  For
   a more detailed configuration one may include sub-TLVs for the
   different OAM functions in order to specify various parameters in
   detail.

   Typically intermediate nodes simply forward OAM configuration TLVs to
   the end-node without any processing or modification At least one
   exception to this is if the FMS sub-TLV Section 2.2.9 is present.
   This sub-TLV MUST be examined even by intermediate nodes that support
   this extension.  The sub-TLV MAY be present if a flag is set in the
   MPLS OAM Functions TLV.

2.1.1.  Configuration of BFD Sessions

   For this specification, BFD MUST run in either one of the two modes:

      - Asynchronous mode, where both sides should be in active mode

      - Unidirectional mode

   In the simplest scenario LSP Ping [RFC5884], or alternatively RSVP-TE
   [RSVP-TE-CONF], is used only to bootstrap a BFD session for an LSP,
   without any timer negotiation.

   Timer negotiation can be performed either in subsequent BFD control
   messages (in this case the operation is similar to LSP Ping based
   bootstrapping described in [RFC5884]) or directly in the LSP-Ping
   configuration messages.

   When BFD Control packets are transported in the ACH encapsulation
   they are not protected by any end-to-end checksum, only lower-layers
   are providing error detection/correction.  A single bit error, e.g. a
   flipped bit in the BFD State field could cause the receiving end to
   wrongly conclude that the link is down and in turn trigger protection
   switching.  To prevent this from happening the BFD Configuration sub-
   TLV, Section 2.2.1, has an Integrity flag that when set enables BFD
   Authentication using Keyed SHA1 with an empty key (all 0s) [RFC5880].
   This would make every BFD Control packet carry an SHA1 hash of itself
   that can be used to detect errors.

   If BFD Authentication using a pre-shared key/password is desired
   (i.e. authentication and not only error detection) the BFD
   Authentication sub-TLV, Section 2.2.4, MUST be included in the BFD
   Configuration sub-TLV.  The BFD Authentication sub-TLV is used to
   specify which authentication method that should be used and which
   pre-shared key/ password that should be used for this particular
   session.  How the key exchange is performed is out of scope of this
   document.



Bellagamba, et al.      Expires February 1, 2016                [Page 5]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


2.1.2.  Configuration of Performance Monitoring

   It is possible to configure Performance Monitoring functionalities
   such as Loss, Delay, Delay/Interpacket Delay variation (jitter), and
   Throughput as described in [RFC6374].

   When configuring Performance monitoring functionalities it is
   possible to choose either the default configuration, by only setting
   the respective flags in the MPLS OAM functions TLV, or a customized
   configuration.  To customize the configuration one would set the
   respective flags in the including the respective Loss and/or Delay
   sub-TLVs).

   By setting the PM Loss flag in the MPLS OAM Functions TLV and
   including the PM Loss sub-TLV, Section 2.2.7, one can configure the
   measurement interval and loss threshold values for triggering
   protection.

   Delay measurements are configured by setting PM Delay flag in the
   MPLS OAM Functions TLV and including the PM Delay sub-TLV,
   Section 2.2.8, one can configure the measurement interval and the
   delay threshold values for triggering protection.

2.1.3.  Configuration of Fault Management Signals

   To configure Fault Management Signals (FMS) and their refresh time
   the FMS flag in the MPLS OAM Functions TLV MUST be set and the FMS
   sub-TLV MUST be included.  When configuring FMS, an implementation
   can enable the default configuration by setting the FMS flag in the
   OAM Function Flags sub-TLV.  In order to modify the default
   configuration the MPLS OAM FMS sub-TLV MUST be included.

   If an intermediate point is meant to originate fault management
   signal messages this means that such an intermediate point is
   associated with a Server MEP through a co-located MPLS-TP client/
   server adaptation function and the Fault Management subscription flag
   in the MPLS OAM FMS sub-TLV been set as indication of the request to
   create the association at each intermediate node of the client LSP.
   Corresponding Server MEP needs to be configured by its own LSP-ping
   session or, alternatively, via an NMS or RSVP-TE.

2.2.  MPLS OAM Functions TLV

   The MPLS OAM Functions TLV presented in Figure 1 is carried as a TLV
   of the MPLS Echo Request/Reply messages [RFC4379].






Bellagamba, et al.      Expires February 1, 2016                [Page 6]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  MPLS OAM Func. Type (TBA1)   |           Length              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |C|V|F|L|D|T|             Reserved  (MBZ)                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   ~                           sub-TLVs                            ~
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                  Figure 1: MPLS OAM Functions TLV format

   The MPLS OAM Functions TLV contains a number of flags indicating
   which OAM functions should be activated as well as OAM function
   specific sub-TLVs with configuration parameters for the particular
   function.

   Type: indicates the MPLS OAM Functions TLV Section 4.

   Length: the length of the MPLS OAM Function Flags field including the
   total length of the sub-TLVs in octets.

   MPLS OAM Function Flags: a bitmap numbered from left to right as
   shown in the figure.

   These flags are defined in this document as presented in Table 1:

   +------------+--------------------+---------------------------------+
   |    Bit     | MPLS OAM Function  | Description                     |
   |  Position  |        Flag        |                                 |
   +------------+--------------------+---------------------------------+
   |     0      |         C          | Continuity Check (CC)           |
   |     1      |         V          | Connectivity Verification (CV)  |
   |     2      |         F          | Fault Management Signal (FMS)   |
   |     3      |         L          | Performance Measurement/Loss    |
   |            |                    | (PM/Loss)                       |
   |     4      |         D          | Performance Measurement/Delay   |
   |            |                    | (PM/Delay)                      |
   |     5      |         T          | Throughput Measurement)         |
   |    6-31    |                    | Reserved                        |
   +------------+--------------------+---------------------------------+

                     Table 1: MPLS OAM Functions Flags

   Sub-TLVs corresponding to the different flags are as follows:




Bellagamba, et al.      Expires February 1, 2016                [Page 7]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


      - BFD Configuration sub-TLV, which MUST be included if either the
      CC, the CV or both MPLS OAM Function flags being set in the MPLS
      OAM Functions TLV .

      - PM Loss sub-TLV within the "Performance Monitoring sub-TLV",
      which MAY be included if the PM/Loss OAM Function flag is set.  If
      the "PM Loss sub-TLV" is not included, default configuration
      values are used.  Such sub-TLV MAY also be included in case the
      Throughput function flag is set and there is the need to specify
      measurement interval different from the default ones.  In fact the
      throughput measurement make use of the same tool as the loss
      measurement, hence the same TLV is used.

      - PM Delay sub-TLV within the "Performance Monitoring sub-TLV",
      which MAY be included if the PM/Delay OAM Function flag is set.
      If the "PM Delay sub-TLV" is not included, default configuration
      values are used.

      - FMS sub-TLV, which MAY be included if the FMS OAM Function flag
      is set.  If the "FMS sub-TLV" is not included, default
      configuration values are used.

2.2.1.  BFD Configuration Sub-TLV

   The BFD Configuration sub-TLV, depicted Figure 2, is defined for BFD
   OAM specific configuration parameters.  The "BFD Configuration sub-
   TLV" is carried as a sub-TLV of the "OAM Functions TLV".

   This TLV accommodates generic BFD OAM information and carries sub-
   TLVs.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | BFD Conf. sub-Type    (100)   |           Length              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |Vers.|N|S|I|G|U|B|         Reserved (set to all 0s)            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   ~                           sub-TLVs                            ~
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                Figure 2: BFD Configuration sub-TLV format

   Sub-type: indicates a new sub-type, the BFD Configuration sub-TLV
   (value 100).




Bellagamba, et al.      Expires February 1, 2016                [Page 8]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   Length: indicates the length of the Value field in octets (4).

   Version: identifies the BFD protocol version.  If a node does not
   support a specific BFD version an error must be generated: "OAM
   Problem/Unsupported OAM Version".

   BFD Negotiation (N): If set timer negotiation/re-negotiation via BFD
   Control Messages is enabled, when cleared it is disabled.

   Symmetric session (S): If set the BFD session MUST use symmetric
   timing values.

   Integrity (I): If set BFD Authentication MUST be enabled.  If the BFD
   Configuration sub-TLV does not include a BFD Authentication sub-TLV
   the authentication MUST use Keyed SHA1 with an empty pre-shared key
   (all 0s).  If the egress LSR does not support BFD Authentication an
   error MUST be generated: "OAM Problem/BFD Authentication
   unsupported".

   Encapsulation Capability (G): if set, it shows the capability of
   encapsulating BFD messages into G-ACh channel.  If both the G bit and
   U bit are set, configuration gives precedence to the G bit.

   Encapsulation Capability (U): if set, it shows the capability of
   encapsulating BFD messages into IP/UDP packets.  If both the G bit
   and U bit are set, configuration gives precedence to the G bit.

   If the egress LSR does not support any of the ingress LSR
   Encapsulation Capabilities an error MUST be generated: "OAM Problem/
   Unsupported BFD Encapsulation format".

   Bidirectional (B): if set, it configures BFD in the Bidirectional
   mode.  If it is not set it configures BFD in unidirectional mode.  In
   the second case, the source node does not expect any Discriminator
   values back from the destination node.

   Reserved: Reserved for future specification and set to 0 on
   transmission and ignored when received.

   The BFD Configuration sub-TLV MUST include the following sub-TLVs in
   the MPLS Echo Request message:

      - Local Discriminator sub-TLV, if B flag is set in the MPLS Echo
      Request;

      - Negotiation Timer Parameters sub-TLV if the N flag is cleared.





Bellagamba, et al.      Expires February 1, 2016                [Page 9]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   The BFD Configuration sub-TLV MUST include the following sub-TLVs in
   the MPLS Echo Reply message:

      - Local Discriminator sub-TLV;

      - Negotiation Timer Parameters sub-TLV if:

         - the N and S flags are cleared, or if:

         - the N flag is cleared and the S flag is set, and the
         Negotiation Timer Parameters sub-TLV received by the egress
         contains unsupported values.  In this case an updated
         Negotiation Timer Parameters sub-TLV, containing values
         supported by the egress node [RFC7419], is returned to the
         ingress.

2.2.2.  Local Discriminator Sub-TLV

   The Local Discriminator sub-TLV is carried as a sub-TLV of the "BFD
   Configuration sub-TLV" and is depicted in Figure 3.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Lcl. Discr. sub-Type (101)   |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Local Discriminator                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

               Figure 3: Local Discriminator sub-TLV format

   Type: indicates a new type, the "Local Discriminator sub-TLV" (value
   101).

   Length: indicates the length of the Value field in octets . (4)

   Local Discriminator: A unique, nonzero discriminator value generated
   by the transmitting system and referring to itself, used to
   demultiplex multiple BFD sessions between the same pair of systems.

2.2.3.  Negotiation Timer Parameters Sub-TLV

   The Negotiation Timer Parameters sub-TLV is carried as a sub-TLV of
   the BFD Configuration sub-TLV and is depicted in Figure 4.







Bellagamba, et al.      Expires February 1, 2016               [Page 10]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Nego. Timer sub-type (102)    |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |         Acceptable Min. Asynchronous TX interval              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |         Acceptable Min. Asynchronous RX interval              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |               Required Echo TX Interval                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

           Figure 4: Negotiation Timer Parameters sub-TLV format

   Sub-type: indicates a new sub-type, the Negotiation Timer Parameters
   sub-TLV (value 102).

   Length: indicates the length of the Value field in octets (12).

   Acceptable Min. Asynchronous TX interval: in case of S (symmetric)
   flag set in the BFD Configuration sub-TLV, defined in Section 2.2.1,
   it expresses the desired time interval (in microseconds) at which the
   ingress LER intends to both transmit and receive BFD periodic control
   packets.  If the receiving edge LSR cannot support such value, it
   SHOULD reply with an interval greater than the one proposed.

   In case of S (symmetric) flag cleared in the BFD Configuration sub-
   TLV, this field expresses the desired time interval (in microseconds)
   at which a edge LSR intends to transmit BFD periodic control packets
   in its transmitting direction.

   Acceptable Min. Asynchronous RX interval: in case of S (symmetric)
   flag set in the BFD Configuration sub-TLV, Figure 2, this field MUST
   be equal to Acceptable Min. Asynchronous TX interval and has no
   additional meaning respect to the one described for "Acceptable Min.
   Asynchronous TX interval".

   In case of S (symmetric) flag cleared in the BFD Configuration sub-
   TLV, it expresses the minimum time interval (in microseconds) at
   which edge LSRs can receive BFD periodic control packets.  In case
   this value is greater than the value of Acceptable Min. Asynchronous
   TX interval received from the other edge LSR, such edge LSR MUST
   adopt the interval expressed in this Acceptable Min. Asynchronous RX
   interval.

   Required Echo TX Interval: the minimum interval (in microseconds)
   between received BFD Echo packets that this system is capable of
   supporting, less any jitter applied by the sender as described in



Bellagamba, et al.      Expires February 1, 2016               [Page 11]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   [RFC5880] sect. 6.8.9.  This value is also an indication for the
   receiving system of the minimum interval between transmitted BFD Echo
   packets.  If this value is zero, the transmitting system does not
   support the receipt of BFD Echo packets.  If the receiving system
   cannot support this value the "Unsupported BFD TX Echo rate interval"
   error MUST be generated.  By default the value is set to 0.

2.2.4.  BFD Authentication Sub-TLV

   The "BFD Authentication sub-TLV" is carried as a sub-TLV of the "BFD
   Configuration sub-TLV" and is depicted in Figure 5.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    BFD Auth. sub-type (103)   |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Auth Type   |  Auth Key ID  |         Reserved (0s)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                Figure 5: BFD Authentication sub-TLV format

   Sub-type: indicates a new type, the BFD Authentication sub-TLV (value
   103).

   Length: indicates the length of the Value field in octets (4).

   Auth Type: indicates which type of authentication to use.  The same
   values as are defined in section 4.1 of [RFC5880] are used.

   Auth Key ID: indicates which authentication key or password
   (depending on Auth Type) should be used.  How the key exchange is
   performed is out of scope of this document.  If the egress LSR does
   not support this Auth Key ID an "OAM Problem/Mismatch of BFD
   Authentication Key ID" error MUST be generated.

   Reserved: Reserved for future specification and set to 0 on
   transmission and ignored when received.

   If BFD Authentication sub-TLV used for a BFD session in Up state then
   the Sender of the MPLS LSP Echo Request SHOULD ensure that old and
   new modes of authentication, i.e. combination of Auth.Type and Auth.
   Key ID, used to send and receive BFD control packets until the Sender
   can confirm that its peer had switched to the new authentication.







Bellagamba, et al.      Expires February 1, 2016               [Page 12]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


2.2.5.  Traffic Class Sub-TLV

   The Traffic Class sub-TLV is carried as a sub-TLV of the "BFD
   Configuration sub-TLV" or "Fault Management Signal sub-TLV"
   Section 2.2.9 and is depicted in Figure 6.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Traffic Class sub-Type (104)  |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  TC |                 Reserved (set to all 0s)                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                  Figure 6: Traffic Class sub-TLV format

   Type: indicates a new type, the "Traffic Class sub-TLV" (value 104).

   Length: indicates the length of the Value field in octets . (4)

   TC: Identifies the Traffic Class (TC) [RFC5462] for periodic
   continuity monitoring messages or packets with fault management
   information.

   If TC sub-TLV is present, then the value of the TC field MUST be used
   as the value of the TC field of an MPLS label stack entry.  If the TC
   sub-TLV is absent from "BFD Configuration sub-TLV" or "Fault
   Management Signal sub-TLV", then selection of the TC value is local
   decision.

2.2.6.  Performance Measurement Sub-TLV

   If the MPLS OAM Functions TLV has either the L (Loss), D (Delay) or T
   (Throughput) flag set, the Performance Measurement sub-TLV MUST be
   present.  Failure to include the correct sub-TLVs MUST result in an
   "OAM Problem/ Configuration Error" error being generated.

   The Performance Measurement sub-TLV provides the configuration
   information mentioned in Section 7 of [RFC6374].  It includes support
   for the configuration of quality thresholds and, as described in
   [RFC6374], "the crossing of which will trigger warnings or alarms,
   and result reporting and exception notification will be integrated
   into the system-wide network management and reporting framework."

   In case the values need to be different than the default ones the
   Performance Measurement sub-TLV MAY include the following sub-TLVs:





Bellagamba, et al.      Expires February 1, 2016               [Page 13]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


      - PM Loss sub-TLV if the L flag is set in the MPLS OAM Functions
      TLV;

      - PM Delay sub-TLV if the D flag is set in the MPLS OAM Functions
      TLV.

   The Performance Measurement sub-TLV depicted in Figure 7 is carried
   as a sub-TLV of the MPLS OAM Functions TLV.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Perf Monitoring Type (200)    |          Length               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |D|L|J|Y|K|C|            Reserved (set to all 0s)               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

             Figure 7: Performance Measurement sub-TLV format

   Sub-type: indicates a new sub-type, the Performance Management sub-
   TLV" (value 200).

   Length: indicates the length of the Value field in octets (4).

   Configuration Flags, for the specific function description please
   refer to [RFC6374]:

      - D: Delay inferred/direct (0=INFERRED, 1=DIRECT).  If the egress
      LSR does not support specified mode an "OAM Problem/Unsupported
      Delay Mode" error MUST be generated.

      - L: Loss inferred/direct (0=INFERRED, 1=DIRECT).  If the egress
      LSR does not support specified mode an "OAM Problem/Unsupported
      Loss Mode" error MUST be generated.

      - J: Delay variation/jitter (1=ACTIVE, 0=NOT ACTIVE).  If the
      egress LSR does not support Delay variation measurements and the J
      flag is set, an "OAM Problem/Delay variation unsupported" error
      MUST be generated.

      - Y: Dyadic (1=ACTIVE, 0=NOT ACTIVE).  If the egress LSR does not
      support Dyadic mode and the Y flag is set, an "OAM Problem/Dyadic
      mode unsupported" error MUST be generated.

      - K: Loopback (1=ACTIVE, 0=NOT ACTIVE).  If the egress LSR does
      not support Loopback mode and the K flag is set, an "OAM Problem/
      Loopback mode unsupported" error MUST be generated.




Bellagamba, et al.      Expires February 1, 2016               [Page 14]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


      - C: Combined (1=ACTIVE, 0=NOT ACTIVE).  If the egress LSR does
      not support Combined mode and the C flag is set, an "OAM Problem/
      Combined mode unsupported" error MUST be generated.

   Reserved: Reserved for future specification and set to 0 on
   transmission and ignored when received.

2.2.7.  PM Loss Measurement Sub-TLV

   The PM Loss Measurement sub-TLV depicted in Figure 8 is carried as a
   sub-TLV of the Performance Measurement sub-TLV.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  PM Loss sub-type (201)       |          Length               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | OTF |T|B|              Reserved (set to all 0s)               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                    Measurement Interval                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Test Interval                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Loss Threshold                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

               Figure 8: PM Loss Measurement sub-TLV format

   Sub-type: indicates a new sub-type, the PM Loss Measurement sub-TLV
   (value 201).

   Length: indicates the length of the Value field in octets (16).

   OTF: Origin Timestamp Format of the Origin Timestamp field described
   in [RFC6374].  By default it is set to IEEE 1588 version 1.  If the
   egress LSR cannot support this value an "OAM Problem/Unsupported
   Timestamp Format" error MUST be generated.

   Configuration Flags, please refer to [RFC6374] for further details:

      - T: Traffic-class-specific measurement indicator.  Set to 1 when
      the measurement operation is scoped to packets of a particular
      traffic class (DSCP value), and 0 otherwise.  When set to 1, the
      DS field of the message indicates the measured traffic class.  By
      default it is set to 1.

      - B: Octet (byte) count.  When set to 1, indicates that the
      Counter 1-4 fields represent octet counts.  When set to 0,



Bellagamba, et al.      Expires February 1, 2016               [Page 15]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


      indicates that the Counter 1-4 fields represent packet counts.  By
      default it is set to 0.

   Reserved: Reserved for future specification and set to 0 on
   transmission and ignored when received.

   Measurement Interval: the time interval (in milliseconds) at which
   Loss Measurement query messages MUST be sent on both directions.  If
   the edge LSR receiving the Path message cannot support such value, it
   SHOULD reply with a higher interval.  By default it is set to (100)
   as per [RFC6375].

   Test Interval: test messages interval in milliseconds as described in
   [RFC6374].  By default it is set to (10) as per [RFC6375].

   Loss Threshold: the threshold value of measured lost packets per
   measurement over which action(s) SHOULD be triggered.

2.2.8.  PM Delay Measurement Sub-TLV

   The PM Delay Measurement sub-TLV" depicted in Figure 9 is carried as
   a sub-TLV of the Performance Monitoring sub-TLV.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  PM Delay Type (202)          |          Length               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | OTF |T|B|             Reserved (set to all 0s)                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                    Measurement Interval                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Test Interval                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Delay Threshold                          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

               Figure 9: PM Delay Measurement sub-TLV format

   Sub-type: indicates a new sub-type, the PM Delay Measurement sub-TLV"
   (value 202).

   Length: indicates the length of the Value field in octets (16).

   OTF: Origin Timestamp Format of the Origin Timestamp field described
   in [RFC6374].  By default it is set to IEEE 1588 version 1.  If the
   egress LSR cannot support this value an "OAM Problem/Unsupported
   Timestamp Format" error MUST be generated.



Bellagamba, et al.      Expires February 1, 2016               [Page 16]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   Configuration Flags, please refer to [RFC6374] for further details:

      - T: Traffic-class-specific measurement indicator.  Set to 1 when
      the measurement operation is scoped to packets of a particular
      traffic class (DSCP value), and 0 otherwise.  When set to 1, the
      DS field of the message indicates the measured traffic class.  By
      default it is set to 1.

      - B: Octet (byte) count.  When set to 1, indicates that the
      Counter 1-4 fields represent octet counts.  When set to 0,
      indicates that the Counter 1-4 fields represent packet counts.  By
      default it is set to 0.

   Reserved: Reserved for future specification and set to 0 on
   transmission and ignored when received.

   Measurement Interval: the time interval (in milliseconds) at which
   Delay Measurement query messages MUST be sent on both directions.  If
   the edge LSR receiving the Path message cannot support such value, it
   can reply with a higher interval.  By default it is set to (1000) as
   per [RFC6375].

   Test Interval: test messages interval (in milliseconds) as described
   in [RFC6374].  By default it is set to (10) as per [RFC6375].

   Delay Threshold: the threshold value of measured two-way delay (in
   milliseconds) over which action(s) SHOULD be triggered.

2.2.9.  Fault Management Signal Sub-TLV

   The FMS sub-TLV depicted in Figure 10 is carried as a sub-TLV of the
   MPLS OAM Configuration sub-TLV.  When both working and protection
   paths are configured, both LSPs SHOULD be configured with identical
   settings of the E flag, T flag, and the refresh timer.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       FMS sub-type (300)      |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |E|S|T|            Reserved           |      Refresh Timer      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   ~                           sub-TLVs                            ~
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

             Figure 10: Fault Management Signal sub-TLV format



Bellagamba, et al.      Expires February 1, 2016               [Page 17]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   Sub-type: indicates a new sub-type, the FMS sub-TLV (value 300).

   Length: indicates the length of the Value field in octets (4).

   FMS Signal Flags are used to enable the FMS signals at end point MEPs
   and the Server MEPs of the links over which the LSP is forwarded.  In
   this document only the S flag pertains to Server MEPs.

   The following flags are defined:

      - E: Enable Alarm Indication Signal (AIS) and Lock Report (LKR)
      signaling as described in [RFC6427].  Default value is 1
      (enabled).  If the egress MEP does not support FMS signal
      generation an "OAM Problem/Fault management signaling unsupported"
      error MUST be generated.

      - S: Indicate to a server MEP that it should transmit AIS and LKR
      signals on the client LSP.  Default value is 0 (disabled).  If a
      Server MEP which is capable of generating FMS messages is for some
      reason unable to do so for the LSP being signaled an "OAM Problem/
      Unable to create fault management association" error MUST be
      generated.

      - T: Set timer value, enabled the configuration of a specific
      timer value.  Default value is 0 (disabled).

      - Remaining bits: Reserved for future specification and set to 0.

   Refresh Timer: indicates the refresh timer of fault indication
   messages, in seconds.  The value MUST be between 1 to 20 seconds as
   specified for the Refresh Timer field in [RFC6427].  If the edge LSR
   receiving the Path message cannot support the value it SHOULD reply
   with a higher timer value.

   FMS sub-TLV MAY include Traffic Class sub-TLV Section 2.2.5.  If TC
   sub-TLV is present, the value of the TC field MUST be used as the
   value of the TC field of an MPLS label stack entry for FMS messages.
   If the TC sub-TLV is absent, then selection of the TC value is local
   decision.

2.2.10.  Source MEP-ID Sub-TLV

   The Source MEP-ID sub-TLV depicted in Figure 11 is carried as a sub-
   TLV of the MPLS OAM Functions TLV.

   Note that support of ITU IDs is out-of-scope.





Bellagamba, et al.      Expires February 1, 2016               [Page 18]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Source MEP-ID sub-type (400)  |           Length              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Source Node ID                          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tunnel ID           |           LSP ID              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                  Figure 11: Source MEP-ID sub-TLV format

   Sub-type: indicates a new sub-type, the Source MEP-ID sub-TLV (value
   400).

   Length: indicates the length of the Value field in octets (8).

   Source Node ID: 32-bit node identifier as defined in [RFC6370].

   Tunnel ID: a 16-bit unsigned integer unique to the node as defined in
   [RFC6370].

   LSP ID: a 16-bit unsigned integer unique within the Tunnel_ID as
   defined in [RFC6370].

3.  Summary of MPLS OAM Configuration Errors

   This is the summary of Return Codes [RFC4379] defined in this
   document:

      - If an egress LSR does not support the specified BFD version, an
      error MUST be generated: "OAM Problem/Unsupported BFD Version".

      - If an egress LSR does not support the specified BFD
      Encapsulation format, an error MUST be generated: "OAM Problem/
      Unsupported BFD Encapsulation format".

      - If an egress LSR does not support BFD Authentication, and it is
      requested, an error MUST be generated: "OAM Problem/BFD
      Authentication unsupported".

      - If an egress LSR does not support the specified BFD
      Authentication Type, an error MUST be generated: "OAM Problem/
      Unsupported BFD Authentication Type".

      - If an egress LSR is not able to use the specified Authentication
      Key ID, an error MUST be generated: "OAM Problem/Mismatch of BFD
      Authentication Key ID".



Bellagamba, et al.      Expires February 1, 2016               [Page 19]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


      - If an egress LSR does not support the specified Timestamp
      Format, an error MUST be generated: "OAM Problem/Unsupported
      Timestamp Format".

      - If an egress LSR does not support specified Delay mode, an "OAM
      Problem/Unsupported Delay Mode" error MUST be generated.

      - If an egress LSR does not support specified Loss mode, an "OAM
      Problem/Unsupported Loss Mode" error MUST be generated.

      - If an egress LSR does not support Delay variation measurements,
      and it is requested, an "OAM Problem/Delay variation unsupported"
      error MUST be generated.

      - If an egress LSR does not support Dyadic mode, and it is
      requested, an "OAM Problem/Dyadic mode unsupported" error MUST be
      generated.

      - If an egress LSR does not support Loopback mode, and it is
      requested, an "OAM Problem/Loopback mode unsupported" error MUST
      be generated.

      - If an egress LSR does not support Combined mode, and it is
      requested, an "OAM Problem/Combined mode unsupported" error MUST
      be generated.

      - If an egress LSR does not support Fault Monitoring Signals, and
      it is requested, an "OAM Problem/Fault management signaling
      unsupported" error MUST be generated.

      - If an intermediate server MEP supports Fault Monitoring Signals
      but is unable to create an association, when requested to do so,
      an "OAM Problem/Unable to create fault management association"
      error MUST be generated.

4.  IANA Considerations

4.1.  TLV and Sub-TLV Allocation

   IANA maintains the Multi-Protocol Label Switching (MPLS) Label
   Switched Paths (LSPs) Ping Parameters registry, and within that
   registry a sub-registry for TLVs and sub-TLVs.

   IANA is requested a new TLV from the standards action range (0-16383)
   and sub-TLVs as follows from this sub-registry.






Bellagamba, et al.      Expires February 1, 2016               [Page 20]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   +------+----------+---------------------------------+---------------+
   | Type | Sub-type | Value Field                     | Reference     |
   +------+----------+---------------------------------+---------------+
   | TBA1 |          | MPLS OAM Functions              | This document |
   |      | 100      | BFD Configuration               | This document |
   |      | 101      | BFD Local Discriminator         | This document |
   |      | 102      | BFD Negotiation Timer           | This document |
   |      |          | Parameters                      |               |
   |      | 103      | BFD Authentication              | This document |
   |      | 104      | Traffic Class                   | This document |
   |      | 200      | Performance Measurement         | This document |
   |      | 201      | PM Loss Measurement             | This document |
   |      | 202      | PM Delay Measurement            | This document |
   |      | 203      | Fault Management Signal         | This document |
   |      | 204      | Source MEP-ID                   | This document |
   +------+----------+---------------------------------+---------------+

                     Table 2: IANA TLV Type Allocation

4.2.  OAM Configuration Errors

   IANA maintains a registry "Multi-Protocol Label Switching (MPLS)
   Label Switched Paths (LSPs) Ping Parameters" registry, and within
   that registry a sub-registry "Return Codes".

   IANA is requested to assign new Return Codes from the Standards
   Action range (0-191) as follows:
























Bellagamba, et al.      Expires February 1, 2016               [Page 21]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   +---------------+-----------------------------------+---------------+
   | Error Value   | Description                       | Reference     |
   | Sub-codes     |                                   |               |
   +---------------+-----------------------------------+---------------+
   | TBA3          | OAM Problem/Unsupported BFD       | This document |
   |               | Version                           |               |
   | TBA4          | OAM Problem/Unsupported BFD       | This document |
   |               | Encapsulation format              |               |
   | TBA5          | OAM Problem/Unsupported BFD       | This document |
   |               | Authentication Type               |               |
   | TBA6          | OAM Problem/Mismatch of BFD       | This document |
   |               | Authentication Key ID             |               |
   | TBA7          | OAM Problem/Unsupported Timestamp | This document |
   |               | Format                            |               |
   | TBA8          | OAM Problem/Unsupported Delay     | This document |
   |               | Mode                              |               |
   | TBA9          | OAM Problem/Unsupported Loss Mode | This document |
   | TBA10         | OAM Problem/Delay variation       | This document |
   |               | unsupported                       |               |
   | TBA11         | OAM Problem/Dyadic mode           | This document |
   |               | unsupported                       |               |
   | TBA12         | OAM Problem/Loopback mode         | This document |
   |               | unsupported                       |               |
   | TBA13         | OAM Problem/Combined mode         | This document |
   |               | unsupported                       |               |
   | TBA14         | OAM Problem/Fault management      | This document |
   |               | signaling unsupported             |               |
   | TBA15         | OAM Problem/Unable to create      | This document |
   |               | fault management association      |               |
   +---------------+-----------------------------------+---------------+

                   Table 3: IANA Return Codes Allocation

5.  Acknowledgements

   The authors would like to thank Nobo Akiya for his useful comments.

6.  Security Considerations

   The signaling of OAM related parameters and the automatic
   establishment of OAM entities introduces additional security
   considerations to those discussed in [RFC3473].  In particular, a
   network element could be overloaded if an attacker were to request
   high frequency liveliness monitoring of a large number of LSPs,
   targeting a single network element.

   Additional discussion of security for MPLS protocols can be found in
   [RFC5920].



Bellagamba, et al.      Expires February 1, 2016               [Page 22]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


7.  References

7.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <http://www.rfc-editor.org/info/rfc2119>.

   [RFC3473]  Berger, L., Ed., "Generalized Multi-Protocol Label
              Switching (GMPLS) Signaling Resource ReserVation Protocol-
              Traffic Engineering (RSVP-TE) Extensions", RFC 3473,
              DOI 10.17487/RFC3473, January 2003,
              <http://www.rfc-editor.org/info/rfc3473>.

   [RFC4379]  Kompella, K. and G. Swallow, "Detecting Multi-Protocol
              Label Switched (MPLS) Data Plane Failures", RFC 4379,
              DOI 10.17487/RFC4379, February 2006,
              <http://www.rfc-editor.org/info/rfc4379>.

   [RFC5654]  Niven-Jenkins, B., Ed., Brungard, D., Ed., Betts, M., Ed.,
              Sprecher, N., and S. Ueno, "Requirements of an MPLS
              Transport Profile", RFC 5654, DOI 10.17487/RFC5654,
              September 2009, <http://www.rfc-editor.org/info/rfc5654>.

   [RFC5860]  Vigoureux, M., Ed., Ward, D., Ed., and M. Betts, Ed.,
              "Requirements for Operations, Administration, and
              Maintenance (OAM) in MPLS Transport Networks", RFC 5860,
              DOI 10.17487/RFC5860, May 2010,
              <http://www.rfc-editor.org/info/rfc5860>.

   [RFC5880]  Katz, D. and D. Ward, "Bidirectional Forwarding Detection
              (BFD)", RFC 5880, DOI 10.17487/RFC5880, June 2010,
              <http://www.rfc-editor.org/info/rfc5880>.

   [RFC5884]  Aggarwal, R., Kompella, K., Nadeau, T., and G. Swallow,
              "Bidirectional Forwarding Detection (BFD) for MPLS Label
              Switched Paths (LSPs)", RFC 5884, DOI 10.17487/RFC5884,
              June 2010, <http://www.rfc-editor.org/info/rfc5884>.

   [RFC6370]  Bocci, M., Swallow, G., and E. Gray, "MPLS Transport
              Profile (MPLS-TP) Identifiers", RFC 6370,
              DOI 10.17487/RFC6370, September 2011,
              <http://www.rfc-editor.org/info/rfc6370>.







Bellagamba, et al.      Expires February 1, 2016               [Page 23]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   [RFC6374]  Frost, D. and S. Bryant, "Packet Loss and Delay
              Measurement for MPLS Networks", RFC 6374,
              DOI 10.17487/RFC6374, September 2011,
              <http://www.rfc-editor.org/info/rfc6374>.

   [RFC6427]  Swallow, G., Ed., Fulignoli, A., Ed., Vigoureux, M., Ed.,
              Boutros, S., and D. Ward, "MPLS Fault Management
              Operations, Administration, and Maintenance (OAM)",
              RFC 6427, DOI 10.17487/RFC6427, November 2011,
              <http://www.rfc-editor.org/info/rfc6427>.

   [RFC6428]  Allan, D., Ed., Swallow Ed., G., and J. Drake Ed.,
              "Proactive Connectivity Verification, Continuity Check,
              and Remote Defect Indication for the MPLS Transport
              Profile", RFC 6428, DOI 10.17487/RFC6428, November 2011,
              <http://www.rfc-editor.org/info/rfc6428>.

7.2.  Informative References

   [RFC3209]  Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V.,
              and G. Swallow, "RSVP-TE: Extensions to RSVP for LSP
              Tunnels", RFC 3209, DOI 10.17487/RFC3209, December 2001,
              <http://www.rfc-editor.org/info/rfc3209>.

   [RFC5036]  Andersson, L., Ed., Minei, I., Ed., and B. Thomas, Ed.,
              "LDP Specification", RFC 5036, DOI 10.17487/RFC5036,
              October 2007, <http://www.rfc-editor.org/info/rfc5036>.

   [RFC5462]  Andersson, L. and R. Asati, "Multiprotocol Label Switching
              (MPLS) Label Stack Entry: "EXP" Field Renamed to "Traffic
              Class" Field", RFC 5462, DOI 10.17487/RFC5462, February
              2009, <http://www.rfc-editor.org/info/rfc5462>.

   [RFC5920]  Fang, L., Ed., "Security Framework for MPLS and GMPLS
              Networks", RFC 5920, DOI 10.17487/RFC5920, July 2010,
              <http://www.rfc-editor.org/info/rfc5920>.

   [RFC6371]  Busi, I., Ed. and D. Allan, Ed., "Operations,
              Administration, and Maintenance Framework for MPLS-Based
              Transport Networks", RFC 6371, DOI 10.17487/RFC6371,
              September 2011, <http://www.rfc-editor.org/info/rfc6371>.

   [RFC6375]  Frost, D., Ed. and S. Bryant, Ed., "A Packet Loss and
              Delay Measurement Profile for MPLS-Based Transport
              Networks", RFC 6375, DOI 10.17487/RFC6375, September 2011,
              <http://www.rfc-editor.org/info/rfc6375>.





Bellagamba, et al.      Expires February 1, 2016               [Page 24]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   [RFC6669]  Sprecher, N. and L. Fang, "An Overview of the Operations,
              Administration, and Maintenance (OAM) Toolset for MPLS-
              Based Transport Networks", RFC 6669, DOI 10.17487/RFC6669,
              July 2012, <http://www.rfc-editor.org/info/rfc6669>.

   [RFC7419]  Akiya, N., Binderberger, M., and G. Mirsky, "Common
              Interval Support in Bidirectional Forwarding Detection",
              RFC 7419, DOI 10.17487/RFC7419, December 2014,
              <http://www.rfc-editor.org/info/rfc7419>.

   [RSVP-TE-CONF]
              Bellagamba, E., Andersson, L., Ward, D., and P.
              Skoldstrom, "Configuration of proactive MPLS-TP
              Operations, Administration, and Maintenance (OAM)
              Functions Using RSVP-TE", 2012, <draft-ietf-ccamp-rsvp-te-
              mpls-tp-oam-ext>.

Authors' Addresses

   Elisa Bellagamba

   Email: elisa.bellagamba@gmail.com


   Gregory Mirsky
   Ericsson

   Email: Gregory.Mirsky@ericsson.com


   Loa Andersson
   Huawei Technologies

   Email: loa@mail01.huawei.com


   Pontus Skoldstrom
   Acreo AB
   Electrum 236
   Kista  164 40
   Sweden

   Phone: +46 8 6327731
   Email: pontus.skoldstrom@acreo.se







Bellagamba, et al.      Expires February 1, 2016               [Page 25]


Internet-Draft       Extensions for MPLS-TP OAM Conf           July 2015


   Dave Ward
   Cisco

   Email: dward@cisco.com


   John Drake
   Juniper

   Email: jdrake@juniper.net









































Bellagamba, et al.      Expires February 1, 2016               [Page 26]

